<!DOCTYPE html>
<html lang=zh>
<head>
    <!-- so meta -->
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="HandheldFriendly" content="True">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=5" />
    <meta name="description" content="前言在使用gcc编译源码时可以使用-g选项在二进制文件中保留调试信息，把二进制文件和调试信息合并在同一个文件中带来的一个显著问题是文件或库的SIZE增大，对于不关心调试的普通用户来说，调试信息是不必要的，且在系统安装和使用过程中显著增加了安装时间及磁盘空间占用。 为了解决这个问题，可以把调试信息从二进制文件中剥离出来保存在单独的文件中，某些linux发行版（redhat系列,debian系列等）将">
<meta property="og:type" content="article">
<meta property="og:title" content="独立的debuginfo文件">
<meta property="og:url" content="https://ioxera.github.io/2021/08/24/%E7%8B%AC%E7%AB%8B%E7%9A%84debuginfo%E6%96%87%E4%BB%B6/">
<meta property="og:site_name" content="Ioxera&#39;s Blog">
<meta property="og:description" content="前言在使用gcc编译源码时可以使用-g选项在二进制文件中保留调试信息，把二进制文件和调试信息合并在同一个文件中带来的一个显著问题是文件或库的SIZE增大，对于不关心调试的普通用户来说，调试信息是不必要的，且在系统安装和使用过程中显著增加了安装时间及磁盘空间占用。 为了解决这个问题，可以把调试信息从二进制文件中剥离出来保存在单独的文件中，某些linux发行版（redhat系列,debian系列等）将">
<meta property="og:locale" content="zh_CN">
<meta property="article:published_time" content="2021-08-24T08:10:33.000Z">
<meta property="article:modified_time" content="2021-08-24T08:10:33.000Z">
<meta property="article:author" content="ioxera">
<meta property="article:tag" content="debufinfo">
<meta name="twitter:card" content="summary">
    
    
      
        
          <link rel="shortcut icon" href="/images/favicon.ico">
        
      

<figure class="highlight text"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br></pre></td><td class="code"><pre><span class="line"># rpm -ql kernel-debuginfo</span><br><span class="line">...</span><br><span class="line">/usr/lib/debug/lib/modules/3.10.0-1160.31.1.el7.x86_64/vdso</span><br><span class="line">/usr/lib/debug/lib/modules/3.10.0-1160.31.1.el7.x86_64/vdso/vdso.so.debug</span><br><span class="line">/usr/lib/debug/lib/modules/3.10.0-1160.31.1.el7.x86_64/vdso/vdso32-int80.so.debug</span><br><span class="line">/usr/lib/debug/lib/modules/3.10.0-1160.31.1.el7.x86_64/vdso/vdso32-syscall.so.debug</span><br><span class="line">/usr/lib/debug/lib/modules/3.10.0-1160.31.1.el7.x86_64/vdso/vdso32-sysenter.so.debug</span><br><span class="line">/usr/lib/debug/lib/modules/3.10.0-1160.31.1.el7.x86_64/vmlinux</span><br><span class="line">...</span><br><span class="line"># file /usr/lib/debug/lib/modules/3.10.0-1160.31.1.el7.x86_64/vmlinux</span><br><span class="line">/usr/lib/debug/lib/modules/3.10.0-1160.31.1.el7.x86_64/vmlinux: ELF 64-bit LSB executable, x86-64, version 1 (SYSV), statically linked, BuildID[sha1]=145340cd0f97d560527fa7222afae8c87699e72b, not stripped</span><br></pre></td></tr></table></figure>
<p><code>kernel-debuginfo</code>中包含各个模块的debuginfo文件及ELF结构的<code>vmlinux</code>文件，此<code>vmlinux</code>文件可用于在gdb调试内核时提供符号信息及确定结构体偏移。</p>
<figure class="highlight text"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br></pre></td><td class="code"><pre><span class="line"># pahole -C cred /usr/lib/debug/lib/modules/3.10.0-1160.31.1.el7.x86_64/vmlinux                                                 </span><br><span class="line">struct cred &#123;</span><br><span class="line">	atomic_t                   usage;                /*     0     4 */</span><br><span class="line">	kuid_t                     uid;                  /*     4     4 */</span><br><span class="line">	kgid_t                     gid;                  /*     8     4 */</span><br><span class="line">	kuid_t                     suid;                 /*    12     4 */</span><br><span class="line">	kgid_t                     sgid;                 /*    16     4 */</span><br><span class="line">	kuid_t                     euid;                 /*    20     4 */</span><br><span class="line">	kgid_t                     egid;                 /*    24     4 */</span><br><span class="line">	kuid_t                     fsuid;                /*    28     4 */</span><br><span class="line">	kgid_t                     fsgid;                /*    32     4 */</span><br><span class="line">	unsigned int               securebits;           /*    36     4 */</span><br><span class="line">	kernel_cap_t               cap_inheritable;      /*    40     8 */</span><br><span class="line">	kernel_cap_t               cap_permitted;        /*    48     8 */</span><br><span class="line">	kernel_cap_t               cap_effective;        /*    56     8 */</span><br><span class="line">	/* --- cacheline 1 boundary (64 bytes) --- */</span><br><span class="line">	kernel_cap_t               cap_bset;             /*    64     8 */</span><br><span class="line">	unsigned char              jit_keyring;          /*    72     1 */</span><br><span class="line"></span><br><span class="line">	/* XXX 7 bytes hole, try to pack */</span><br><span class="line"></span><br><span class="line">	struct key *               session_keyring;      /*    80     8 */</span><br><span class="line">	struct key *               process_keyring;      /*    88     8 */</span><br><span class="line">	struct key *               thread_keyring;       /*    96     8 */</span><br><span class="line">	struct key *               request_key_auth;     /*   104     8 */</span><br><span class="line">	void *                     security;             /*   112     8 */</span><br><span class="line">	struct user_struct *       user;                 /*   120     8 */</span><br><span class="line">	/* --- cacheline 2 boundary (128 bytes) --- */</span><br><span class="line">	struct user_namespace *    user_ns;              /*   128     8 */</span><br><span class="line">	struct group_info *        group_info;           /*   136     8 */</span><br><span class="line">	struct callback_head       rcu;                  /*   144    16 */</span><br><span class="line">	kernel_cap_t               cap_ambient;          /*   160     8 */</span><br><span class="line"></span><br><span class="line">	/* size: 168, cachelines: 3, members: 25 */</span><br><span class="line">	/* sum members: 161, holes: 1, sum holes: 7 */</span><br><span class="line">	/* last cacheline: 40 bytes */</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>
<p>使用<code>pahole</code>工具可以解析调试信息并快速确定二进制文件中目标结构体成员及偏移，后两列分别给出了成员变量在结构体中的偏移及成员变量的大小。</p>
<h2 id="参考文献"><a href="#参考文献" class="headerlink" title="参考文献"></a>参考文献</h2><ol>
<li><a href="https://sourceware.org/gdb/onlinedocs/gdb/Separate-Debug-Files.html">Debugging Information in Separate Files</a></li>
<li><a href="http://dwarfstd.org/doc/DWARF4.pdf">DWARF4</a></li>
</ol>

  </div>
</article>



        
          <div id="footer-post-container">
  <div id="footer-post">

    <div id="nav-footer" style="display: none">
      <ul>
         
          <li><a href="/">首页</a></li>
         
          <li><a href="/about/">关于</a></li>
         
